from enum import Enum


MAX_LENGTH_REVIEW_TEXT: int = 5000


class StatusSentiment(str, Enum):
    positive = "positive"
    neutral = "neutral"
    negative = "negative"


GOOD_WORDS = {
    "отлично", "хорошо", "замечательно", "супер", "прекрасно", "потрясающе", "великолепно",
    "невероятно", "радостно", "приятно", "люблю", "улыбка", "позитив", "вдохновляюще",
    "добро", "счастье", "радость", "классно", "замечательно", "чудесно", "ярко",
    "удивительно", "идеально", "сильный", "успех", "достижение", "харизма", "уверенно",
    "спокойно", "поддержка", "помощь", "подруга", "друг", "уважение", "надежно", "искренне",
    "забота", "ласка", "нежно", "любовь", "очаровательный", "гениально", "шикарно",
    "талантливый", "творческий", "радушно", "комфортно", "уютно", "безопасно",
    "благополучие", "гармония", "благодарю", "благодарность", "доброта", "прощение",
    "восхитительно", "чисто", "свежо", "здорово", "удачно", "плодотворно", "заботливо",
    "эффективно", "слаженно", "мирно", "солнечно", "душевно", "лучший", "любимый",
    "достижение", "оптимизм", "светло", "радужно", "улыбчивый", "задорно", "мило",
    "весело", "приятельский", "успешно", "благой", "хорош"
}
BAD_WORDS = {
    "плохо", "ужасно", "отвратительно", "кошмар", "ненавижу", "тупо", "глупо",
    "идиот", "дурак", "бесполезно", "бесполезный", "слабый", "ненадежно", "провал",
    "катастрофа", "неудача", "падение", "стыдно", "грязно", "мерзко", "подло",
    "грубо", "нагло", "ненависть", "гнев", "ярость", "оскорбление", "противно",
    "шокирующе", "разочарование", "потеря", "убыток", "болезненно", "ужас", "страшно",
    "пугающе", "опасно", "угроза", "враждебно", "агрессивно", "скандал", "обман",
    "ложь", "предательство", "позор", "деспот", "тирания", "жестоко", "неприятно",
    "тоскливо", "депрессия", "отчаяние", "бессмысленно", "хаос", "неудовлетворительно",
    "плачевно", "трагично", "беспорядок", "порок", "алчность", "зависть", "жадность",
    "лицемерие", "вред", "мошенник", "нечестно", "несправедливо", "гнусно", "низко",
    "злобно", "подделка", "коварно", "пошло", "гадко", "нагрузка", "угнетение",
    "унижение", "страдание", "боль", "печаль", "разрушение", "плохой"
}
